app/views/dashboard/_side_tabs.html.erb

        <li><%= link_to "Social",social_settings_path %></li>
        <li><%= link_to "Notifications",current_user.notification.present? ? edit_notifications_setting_path(current_user.notification.id) : notifications_setting_path(current_user) %></li>
        <li><%= link_to "Store",current_user.store.present? ? edit_store_path(current_user.store.id): new_store_path %></li>
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = 1 LIMIT 1
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = 1 LIMIT 1