app/controllers/home_controller.rb

SELECT "products".* FROM "products" LIMIT 1
---
  def index
    if signed_in?
      #######Important######
      #@who_to_subscribe_to = current_user.who_to_subscibe_to.limit(5)
      ###################
      if Product.first != nil