app/controllers/profiles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'kapil07518' LIMIT 1
---
  def show
    @user = User.find_by_username(params[:username])