app/controllers/social_sites_controller.rb

INSERT INTO "users" ("account_activation_code", "auth_secret", "avatar_id", "balance", "bio", "card_details_id", "confirmation_sent_at", "confirmation_token", "confirmed_at", "country", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "first_name", "gender", "last_name", "last_sign_in_at", "last_sign_in_ip", "localization", "location", "picture", "provider", "provider_id", "ref_id", "referer", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "timezone", "token", "uncleared_balance", "unconfirmed_email", "updated_at", "user_address_id", "username", "verified", "website") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."provider_id" = '562718638' LIMIT 1
SELECT 1 AS one FROM "users" WHERE "users"."provider" = 'facebook' AND "users"."provider_id" = '100002757454547' LIMIT 1
---
  def create
    auth_hash = request.env['omniauth.auth']
    if current_user
      SocialConnection.create(:user_id => current_user.id,:token =>auth_hash['credentials']['token'],:auth_secret =>auth_hash['credentials']['secret'],:provider =>auth_hash["provider"],:provider_id => auth_hash["uid"]) if !SocialConnection.exists?(:provider => auth_hash["provider"],:provider_id => auth_hash["uid"])
      redirect_to "/find_friends"
    else
      if User.exists?(:provider => auth_hash["provider"],:provider_id => auth_hash["uid"])