app/controllers/stores_controller.rb

SELECT "themes".* FROM "themes"
---
  def new
    @store = Store.new
    @themes = Theme.all