app/controllers/user_registrations_controller.rb

INSERT INTO "users" ("account_activation_code", "auth_secret", "avatar_id", "balance", "bio", "card_details_id", "confirmation_sent_at", "confirmation_token", "confirmed_at", "country", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "first_name", "gender", "last_name", "last_sign_in_at", "last_sign_in_ip", "localization", "location", "picture", "provider", "provider_id", "ref_id", "referer", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "timezone", "token", "uncleared_balance", "unconfirmed_email", "updated_at", "user_address_id", "username", "verified", "website") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40) RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    o =  [('a'..'z'),('A'..'Z')].map{|i| i.to_a}.flatten
    @user.account_activation_code = (0...16).map{ o[rand(o.length)] }.join
    if @user.save_with(session[:referer])

UPDATE "users" SET "account_activation_code" = 'VgFSacKZMmccpSsv', "updated_at" = '2013-11-25 11:57:07.839301' WHERE "users"."id" = 1
---
  def resend_confirmations
    @user = current_user
    if @user.account_activation_code != nil
      o =  [('a'..'z'),('A'..'Z')].map{|i| i.to_a}.flatten
      @user.account_activation_code = (0...16).map{ o[rand(o.length)] }.join
      @user.save

SELECT "users".* FROM "users" WHERE "users"."account_activation_code" = 'VgFSacKZMmccpSsv' LIMIT 1
UPDATE "users" SET "account_activation_code" = NULL, "confirmed_at" = '2013-11-25 11:57:44.838104', "updated_at" = '2013-11-25 11:57:44.842485' WHERE "users"."id" = 1
---
  def confirm_account
    @user = User.find_by_account_activation_code(params[:confirm_token])
    @user.update_attributes({
        :account_activation_code => nil,
        :confirmed_at => Time.now
      })